Revit 2027 API
TableCellStyle.SheetBackgroundColor Property
 The background color of this cell in the sheet view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SheetBackgroundColor { get; }
Public ReadOnly Property SheetBackgroundColor As Color
	Get
public:
property Color^ SheetBackgroundColor {
	Color^ get ();
}
member SheetBackgroundColor : Color with get
Property Value
Color
Remarks
 In most cases the background color on the sheet view is the same as it is in the grid view. The background may be different if conditional formatting is applied only in the grid view.
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace